snlkuharlocal/src/Documents/ПланРаботАсу/ПланРаботАсу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланРаботАсу</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийТекущейНедели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСледующейНедели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ЗадачиАСУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеВыполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Внеплановая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеренесенаСПрошлогоПлана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/СостояниеЗадачи/СостояниеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостояниеЗадачи</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Done</description>
    </items>
    <items>
      <name>НетАктов</name>
      <description>Нет актов</description>
    </items>
    <items>
      <name>Отклонённые</name>
      <description>ОтменённыеЗадачи</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПланРаботАсу/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Автор = параметрысеанса.Пользователь.ФизЛицо;
	Задачи.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	дата=НачалоНедели(дата);
	ДатаОкончания=КонецНедели(Дата);
	// Кухарь А.Ю. 12.05.2022 начало
	//
	если ЭтоНовый() тогда
		если не ЗначениеЗаполнено(Исполнитель) и ЗначениеЗаполнено(ПодразделениеИсполнителя) тогда
			Исполнитель=документы.ПланРаботАсу.ПолучитьИсполнителяПоПодразделению(ПодразделениеИсполнителя);
		КонецЕсли;
		
		автор=ПараметрыСеанса.Пользователь.ФизЛицо;	
	КонецЕсли;
	// Кухарь А.Ю. 12.05.2022 конец
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	для каждого СтрТЧ из ЭтотОбъект.Задачи цикл
		ЗадачаОбъект=СтрТЧ.Задача.ПолучитьОбъект();
		если не ЗадачаОбъект.Распределена тогда
			ЗадачаОбъект.Распределена=Истина;
		КонецЕсли;
		
		
		
	КонецЦикла; 
КонецПроцедуры

Функция ПолучитьЗадачиПрошлогоПлана(ТекПодразделение, ТекДок = Неопределено) Экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланРаботАсу.Ссылка КАК Ссылка,
	|	ПланРаботАсу.Дата КАК Дата
	|ПОМЕСТИТЬ ТЗПлан
	|ИЗ
	|	Документ.ПланРаботАсу КАК ПланРаботАсу
	|ГДЕ
	|	ПланРаботАсу.Ссылка <> &ТекДок
	|	И ПланРаботАсу.Дата < &ТекДата
	|	И ПланРаботАсу.Проведен
	|	И ПланРаботАсу.ПодразделениеИсполнителя = &ТекПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланРаботАсуЗадачи.Задача КАК Задача,
	|	ТЗПлан.Ссылка КАК Ссылка,
	|	ПланРаботАсуЗадачи.Задача.СостояниеЗадачи КАК ЗадачаСостояниеЗадачи
	|ПОМЕСТИТЬ ТЗЗадач
	|ИЗ
	|	ТЗПлан КАК ТЗПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланРаботАсу.Задачи КАК ПланРаботАсуЗадачи
	|		ПО ТЗПлан.Ссылка = ПланРаботАсуЗадачи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗЗадач.Задача КАК Задача
	|ИЗ
	|	ТЗЗадач КАК ТЗЗадач
	|ГДЕ
	|	ТЗЗадач.Задача.Проведен
	|	И НЕ ТЗЗадач.Задача.СостояниеЗадачи В (&СписокСостояний)
	|	И ТЗЗадач.Задача.Распределена";
	если ТекДок=Неопределено тогда
		ТекДок=документы.ПланРаботАсу.ПустаяСсылка();
		ТекДата=НачалоНедели(ТекущаяДата());
	иначе
		ТекДата=ТекДок.Дата;
	КонецЕсли;
	
	запрос.УстановитьПараметр("ТекДок",ТекДок);
	запрос.УстановитьПараметр("ТекДата",ТекДата);
	запрос.УстановитьПараметр("ТекПодразделение",ТекПодразделение);
	
	СписокСостояний=новый СписокЗначений;
	СписокСостояний.Добавить(Справочники.СостояниеЗадачи.Выполнена);
	СписокСостояний.Добавить(Справочники.СостояниеЗадачи.Отклонённые); 
	// Андреев И.Д. 31.08.2022 начало
	СписокСостояний.Добавить(Справочники.СостояниеЗадачи.НайтиПоКоду("000000009")); 
	// Андреев И.Д. 31.08.2022 конец
	
	запрос.УстановитьПараметр("СписокСостояний",СписокСостояний);
	Возврат запрос.Выполнить().Выгрузить();
	
	
КонецФункции
